{"inkVersion":21,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"OnPhone":["#","^speaker: Professor Ian","/#","^HEY ANDRES!!!","\n","^Sorry I wake you up!","\n","^I-I-I-I NEED YOU RIGHT NOW! I have a good news about our loooooong time project!","\n","^Come, Meet me at my lab!!!","\n","end",{"#f":1}],"OnEnterLab":["#","^speaker: Professor Ian","/#","^There you are, partner! I'm glad you came this late at night.","\n","^Come here, I want to show you something..","\n","end",{"#f":1}],"OnLaboratorySpeak":["#","^speaker: Professor Ian","/#","^Look at this, Andres! Our project is finally working! After many years of hard work and numerous challenges, our Dimensional Portal Watch is now operational!","\n","^We can now travel to another dimension, Andres! I'm so excited to try our machine. Put it on, Andres!","\n","^This project of ours requires a strong host because it drains the host's energy to create a portal. Since I'm already old, this Portal Watch might not work for me anymore. So, you're the only one who can wear it to test it out.","\n","end",{"#f":1}],"OnLaboratoryTesting":["#","^speaker: Professor Ian","/#","^Okay, Andres, I made a few changes to the system you created. But don't worry, I promise I only made a few adjustments!","\n","^So, you need to press 'Initialize host' to charge the machine. The machine needs to be at 100% charge to generate a portal.","\n","^And...","\n","^You might feel a bit tired because the machine requires your energy.","\n","^So, when you start feeling like you're about to collapse, just press 'Cancel charge.'","\n","^Then, we'll have to wait for another year...","\n","^or another many years...","\n","^or another many, many years.","\n","^...","\n","^That's the spirit, Andres! I know you're strong, so the machine will reach 100% charge.","\n","^Now, touch the wall with the machine because it will create the portal on the wall.","\n","^And press 'Generate Portal,' and...","\n","^Good luck, Partner.","\n","end",{"#f":1}],"OnLaboratoryTriggerTest":["^Oh, God!","\n","^You did it, Andres!","\n","^You really did it, Andres! We can now travel to another dimension!","\n","^Let's jump in 3...","\n","^2... ","#","^timeline: playerJumpToPortal","/#","\n","^...","\n","^Oh! I forgot to bring something!","\n","end",{"#f":1}],"OnLaboratoryWorried":["^Andres?!","\n","^Oh... No....!!","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}